Documents/СверкаВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>СверкаВзаиморасчетов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьОрганизациюВПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписаниеВыбораДоговоров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьОтветственного</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СальдоНачалоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СортироватьПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСверокВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерВПредставлениеПоступленияНаСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерВПредставлениеРасходаСоСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьСчетФактуруВПредставлениеДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДокументКонтрагента</Name>
					<Comment>Только для электронных документов, устанавливается программно</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
								<v8:Type>cfg:DocumentRef.ПрочиеРасходы</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
								<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗакрытиеМесяца</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДоговора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолгОрганизации</Name>
							<Comment>Долг организации по данным организации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолгКонтрагента</Name>
							<Comment>Долг контрагента по данным контрагента</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВхДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВхНомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
								<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходСоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетОПереработке</v8:Type>
								<v8:Type>cfg:DocumentRef.ПрочиеРасходы</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеВКассу</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
								<v8:Type>cfg:DocumentRef.Взаимозачет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
								<v8:Type>cfg:DocumentRef.ДополнительныеРасходы</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВалютаДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолгОрганизации</Name>
							<Comment>Долг контрагента по данным контрагента</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолгКонтрагента</Name>
							<Comment>Долг организации по данным контрагента</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОперации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоговорыКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыСПрочимиКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПрочимиКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>АПК:1208</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СверкаВзаиморасчетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Область БиблиотекаСтандартныхПодсистем
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#КонецОбласти
	
	УстановитьДоступностьЭлементов();
	
	Если Константы.УчетПоКомпании.Получить() Тогда
		
		// Если ведется учет по компании в целом, необходимо удалить связь выбора по организации
		СвязьПараметровВыбора = Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.Контрагент");
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(СвязьПараметровВыбора);
		
		Элементы.ДанныеОрганизацииРасчетныйДокумент.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.ДанныеКонтрагентаРасчетныйДокумент.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
		
		Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			
			Объект.Организация = Справочники.Организации.ОрганизацияКомпания();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ВходящийНомерВПредставлениеПоступленияНаСчет = Истина;
		
	КонецЕсли;
	
	ВестиРасчетыПоДоговорам = ?(ЗначениеЗаполнено(Объект.Контрагент), Объект.Контрагент.ВестиРасчетыПоДоговорам, Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОписаниеВыбораДоговоров", "Доступность", ВестиРасчетыПоДоговорам);
	
	ОтчетыУНФ.ПриСозданииНаСервереФормыСвязанногоОбъекта(ЭтотОбъект);
	
	ПечатьДокументовУНФ.УстановитьОтображениеПодменюПечати(Элементы.ПодменюПечать);
	ПечатьДокументовУНФ.ДобавитьИнформациюПоНовомуФаксимиле(ЭтотОбъект);

	// ЭДО
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.КомандыЭДО_ФормаДокумента(ЭтотОбъект);
	// Конец ЭДО
	
	Пользователь = Пользователи.ТекущийПользователь();
	ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов =
		УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,
			"ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов");	

	ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов =
		УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователь,
			"ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов");	
			
	УстановитьВидимостьЭлементовПоНастройкеПользователя(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Объект.Ссылка = Неопределено Тогда
		
		ПересчитатьОстатки(ЭтотОбъект);
		
	КонецЕсли;
	
	ЗаполнитьЗаголовокПоВыбраннымДоговорам();
	УстановитьКартинкуСтраницыДанныеКонтрагента();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭДО
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	
	ПриИзмененииСпособаСоставленияЭД();
	// Конец ЭДО
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПоказатьПодтверждениеЗакрытияФормыСФайлами(ЭтотОбъект, Отказ, ЗавершениеРаботы, Объект.Ссылка);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ОценкаПроизводительностиКлиент.ЗамерВремени("Проведение"+ РаботаСФормойДокументаКлиентСервер.ПолучитьИмяФормыСтрокой(ЭтотОбъект.ИмяФормы));
	КонецЕсли;
	// СтандартныеПодсистемы.ОценкаПроизводительности
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ЭДО
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.КомандыЭДО_ПриЧтенииФормыДокумента(ЭтотОбъект);
	// Конец ЭДО
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Обсуждения
	ОбсужденияУНФ.ПослеЗаписиНаСервере(ТекущийОбъект);	
	// Конец Обсуждения
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// ЭДО
	ПараметрыПослеЗаписи = ОбменСКонтрагентами.ПараметрыПослеЗаписиНаСервере();
	ПараметрыПослеЗаписи.Форма = ЭтотОбъект;
	ПараметрыПослеЗаписи.ДокументСсылка = Объект.Ссылка;
	ПараметрыПослеЗаписи.КонтроллерСостояниеЭДО = Элементы.СостояниеЭДО;
	ПараметрыПослеЗаписи.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентами.ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи, ПараметрыПослеЗаписи);
	// Конец ЭДО
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита "ВалютаДокумента"
//
Процедура ВалютаДокументаПриИзменении(Элемент)
	
	ОчиститьДанныеДокумента();
	ЗаполнитьПоОстаткам();
	
	//
	// Автоматического заполнения данных контрагента не выполняем, так как ТЧ могла быть заполнена вручную.
	//
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

&НаКлиенте
// Процедура - обработчик события "Открытие" поля "ДанныеОрганизацииОписаниеДокумента".
//
Процедура ДанныеОрганизацииОписаниеДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеТекущейСтроки = Элементы.ДанныеОрганизации.ТекущиеДанные;
	Если НЕ ДанныеТекущейСтроки = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ДанныеТекущейСтроки.РасчетныйДокумент) Тогда
			
			ПоказатьЗначение(, ДанныеТекущейСтроки.РасчетныйДокумент);
			
		Иначе
			
			ТекстСообщения = НСтр("ru = 'Строка не привязана к расчетному документу. 
				|Для привязки необходимо включить видимость соответствующей колонки и указать документ самостоятельно.'");
				
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДанныеОрганизацииОписаниеДокументаОткрытие()

&НаКлиенте
// Процедура - обработчик события "Открытие" поля "ДанныеКонтрагентаОписаниеДокумента".
//
Процедура ДанныеКонтрагентаОписаниеДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеТекущейСтроки = Элементы.ДанныеКонтрагента.ТекущиеДанные;
	
	Если НЕ ДанныеТекущейСтроки = Неопределено Тогда
		
		Если ЗначениеЗаполнено(ДанныеТекущейСтроки.РасчетныйДокумент) Тогда
			
			ПоказатьЗначение(, ДанныеТекущейСтроки.РасчетныйДокумент);
			
		Иначе
			
			ТекстСообщения = НСтр("ru = 'Строка не привязана к расчетному документу. 
				|Для привязки необходимо включить видимость соответствующей колонки и указать документ самостоятельно.'");
				
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры // ДанныеКонтрагентаОписаниеДокументаОткрытие()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "ДанныеОрганизацииДоговор".
//
Процедура ДанныеОрганизацииДоговорПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДанныеОрганизации.ТекущиеДанные;
	
	Если ДанныеТекущейСтроки <> Неопределено 
		И ЗначениеЗаполнено(ДанныеТекущейСтроки.Договор) Тогда
		
		ДанныеДоговора = Новый Структура;
		ПолучитьДанныеДоговора(ДанныеДоговора, ДанныеТекущейСтроки.Договор);
		ДанныеТекущейСтроки.ВалютаДоговора = ДанныеДоговора.ВалютаДоговора;
		
	КонецЕсли;
	
КонецПроцедуры // ДанныеОрганизацииДоговорПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Статус".
//
Процедура СтатусПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов()
	
КонецПроцедуры // СтатусПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "РасчетныйДокумент" таблицы "ДанныеКонтрагента"
//
Процедура ДанныеКонтрагентаРасчетныйДокументПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДанныеКонтрагента.ТекущиеДанные;
	ЗаполнитьОписаниеРасчетногоДокумента(ДанныеТекущейСтроки, Ложь);
	
КонецПроцедуры // ДанныеКонтрагентаРасчетныйДокументПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Договор" таблицы "ДанныеКонтрагента"
//
Процедура ДанныеКонтрагентаДоговорПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеКонтрагента.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("Договор", ТекущиеДанные.Договор);
		ДанныеСтроки.Вставить("РасчетныйДокумент", ТекущиеДанные.РасчетныйДокумент);
		ДанныеСтроки.Вставить("ВхНомерДокумента", ТекущиеДанные.ВхНомерДокумента);
		ДанныеСтроки.Вставить("ВхДатаДокумента", ТекущиеДанные.ВхДатаДокумента);
		
		// При ручном добавлении предполагаем что вх. номер и дату пользователь указал самостоятельно
		ОписаниеРасчетногоДокументаКонтрагента(ДанныеСтроки);
		
		Если ДанныеСтроки.Свойство("ВалютаДокумента") Тогда
			ТекущиеДанные.ВалютаДокумента = ДанныеСтроки.ВалютаДокумента;
		Иначе
			ТекущиеДанные.ВалютаДокумента = Объект.ВалютаДокумента;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДанныеКонтрагентаДоговорПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении табличного части ПоДаннымКонтрагента
//
Процедура ДанныеКонтрагентаПриИзменении(Элемент)
	
	ПересчитатьОстатки(ЭтотОбъект);
	УстановитьКартинкуСтраницыДанныеКонтрагента();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "РасчетныйДокумент" таблицы "ДанныеОрганизации".
//
Процедура ДанныеОрганизацииРасчетныйДокументПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДанныеОрганизации.ТекущиеДанные;
	ЗаполнитьОписаниеРасчетногоДокумента(ДанныеТекущейСтроки, Истина);
	
КонецПроцедуры //ДанныеОрганизацииРасчетныйДокументПриИзменении()

&НаКлиенте
// Процедура - обработчик события изменения статуса сверки
//
Процедура СтатусОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Перем Ошибки, Отказ;
	
	Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.СтатусыСверокВзаиморасчетов.Сверена") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ПодписьОтветственного) Тогда
			
			ТекстСообщения = НСтр("ru = 'Неверно заполнено ответственное лицо организации.'");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПодписьОтветственного", ТекстСообщения, Неопределено);
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.ПредставительКонтрагента) Тогда
			
			ТекстСообщения = НСтр("ru = 'Неверно заполнен представитель контрагента.'");
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Объект.ПредставительКонтрагента", ТекстСообщения, Неопределено);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры //СтатусОбработкаВыбора()

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля контрагент
//
Процедура КонтрагентПриИзменении(Элемент)
	Перем ДанныеКонтрагента;
	
	ОчиститьДанныеДокумента();
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ПолучитьДанныеКонтрагента(ДанныеКонтрагента);
		Объект.ПредставительКонтрагента = ДанныеКонтрагента.КонтактноеЛицо;
		ВестиРасчетыПоДоговорам = ДанныеКонтрагента.ВестиРасчетыПоДоговорам;
		
	Иначе
		
		Объект.ДоговорыКонтрагентов.Очистить();
		Объект.ПредставительКонтрагента = Неопределено;
		
		ОписаниеВыбораДоговоров = НСтр("ru = 'Договоры не выбраны'");
		
	КонецЕсли;
	
КонецПроцедуры //КонтрагентПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении табличного части ПоДаннымОрганизации
//
Процедура ДанныеОрганизацииПриИзменении(Элемент)
	
	ПересчитатьОстатки(ЭтотОбъект);
	
КонецПроцедуры //ДанныеОрганизацииДляИзменения()

&НаКлиенте
// Процедура - обработчик события Нажатие реквизита ОписаниеВыбораДоговоров
//
Процедура ОписаниеВыбораДоговоровНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыДокумента = Новый Структура;
	ПараметрыДокумента.Вставить("Организация", Объект.Организация);
	ПараметрыДокумента.Вставить("Контрагент", Объект.Контрагент);
	ПараметрыДокумента.Вставить("УчетПоКомпании", УчетПоКомпании);
	ПараметрыДокумента.Вставить("ДоговорыКонтрагентов", Объект.ДоговорыКонтрагентов);
	ПараметрыДокумента.Вставить("СортироватьПоДоговорам", Объект.СортироватьПоДоговорам);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораДоговоровКонтрагента", ЭтотОбъект);
	
	ОткрытьФорму("Документ.СверкаВзаиморасчетов.Форма.ФормаДоговоровКонтрагента", ПараметрыДокумента, ЭтотОбъект, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОписаниеВыбораДоговоровНажатие()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	Если НЕ УчетПоКомпании Тогда
		КонтрагентПриИзменении(Неопределено);
	КонецЕсли;
	
	ОчиститьДанныеДокумента();
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита НачалоПериода
//
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ОчиститьДанныеДокумента();
	
КонецПроцедуры // НачалоПериодаПриИзменении()

&НаКлиенте
// Процедура - обработчик события ПриИзменении реквизита НачалоПериода
//
Процедура КонецПериодаПриИзменении(Элемент)
	
	ОчиститьДанныеДокумента();
	
КонецПроцедуры // КонецПериодаПриИзменении()

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКонтрагентаВхДатаПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДанныеКонтрагента.ТекущиеДанные;
	ЗаполнитьОписаниеРасчетногоДокумента(ДанныеТекущейСтроки, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеКонтрагентаВхНомерПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДанныеКонтрагента.ТекущиеДанные;
	ЗаполнитьОписаниеРасчетногоДокумента(ДанныеТекущейСтроки, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОрганизацииДатаДокументаПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДанныеОрганизации.ТекущиеДанные;
	ЗаполнитьОписаниеРасчетногоДокумента(ДанныеТекущейСтроки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеОрганизацииНомерДокументаПриИзменении(Элемент)
	
	ДанныеТекущейСтроки = Элементы.ДанныеОрганизации.ТекущиеДанные;
	ЗаполнитьОписаниеРасчетногоДокумента(ДанныеТекущейСтроки, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоДоговорамПриИзменении(Элемент)
	
	Если Объект.ДанныеОрганизации.Количество() > 0 Тогда
		ТестВопроса	= НСтр("ru = 'Табличные части будут очищены. Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикПослеВопросаООчисткеГруппироватьПоДоговорам", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТестВопроса, РежимДиалогаВопрос.ДаНет, 0);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДекорацияРеквизитыПечатиНажатие(Элемент)
	
	ОткрытьФормуРеквизитыПечати();
	
КонецПроцедуры

&НаКлиенте
// Вызывает процедуру инициализации пустых входящих дат, датами расчетных документов
//
Процедура ЗаполнитьПоДатамРасчетныхДокументов(Команда)
	
	Если Объект.ДанныеКонтрагента.Количество() < 1 Тогда
		
		ТекстСообщения = НСтр("ru = 'Табличная часть взаиморасчетов по данным контрагента пуста.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	ЗаполнитьДатыВСведенияхКонтрагентаИзРасчетныхДокументов();
	
КонецПроцедуры //ЗаполнитьПоДатамРасчетныхДокументов()

&НаКлиенте
// Процедура - обработчик команды "КомандаЗаполнитьПоОстаткам".
//
Процедура ЗаполнитьПоДаннымУчета(Команда)
	
	ЗаполнятьПоВходящимДатам = Ложь;
	ЗаполнитьОстаткамиНаКлиенте();
	
КонецПроцедуры // КомандаЗаполнитьПоОстаткам()

// Процедура - обработчик команды "ЗаполнитьПоВходящимДатам".
//
&НаКлиенте
Процедура ЗаполнитьПоВходящимДатам(Команда)
	
	ЗаполнятьПоВходящимДатам = Истина;
	ЗаполнитьОстаткамиНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
// Процедура заполняет табличное поле Данные контрагента по данным организации
//
//
Процедура ПеренестиИзДанныхОрганизации(Команда)
	
	Если Объект.ДанныеОрганизации.Количество() < 1 Тогда
		
		ТекстСообщения = НСтр("ru = 'Не заполнена табличная часть с данными организации.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
		
	КонецЕсли;
	
	Если Объект.ДанныеКонтрагента.Количество() > 0 Тогда
		
		ТестВопроса	= НСтр("ru = 'Табличная часть будет очищена и заполнена повторно. Продолжить?'");
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикПослеВопросаООчистке", ЭтотОбъект, "ДанныеКонтрагента");
		ПоказатьВопрос(ОписаниеОповещения, ТестВопроса, РежимДиалогаВопрос.ДаНет, 0);
		
	Иначе
		
		ЗаполнитьСведенияКонтрагентаПоДаннымОрганизации();
		
	КонецЕсли;
	
КонецПроцедуры //ЗаполнитьДанныеКонтрагентаПоДаннымОрганизации()

&НаКлиенте
// Процедура - обработчик команды "УстановитьИнтервал".
//
Процедура УстановитьИнтервал(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период.ДатаНачала = Объект.НачалоПериода;
	Диалог.Период.ДатаОкончания = Объект.КонецПериода;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПериодаЗаполнения", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры // УстановитьИнтервал()

&НаКлиенте
Процедура НастройкаФормы(Команда)
	
	ОткрытьФормуНастройки(Истина);
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, Элементы.ФормаНастройкаФормы, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуНастройки(ПередаватьВидДокумента)
	
	СтруктураПараметров = Новый Структура;
	
	Если ПередаватьВидДокумента Тогда
		СтруктураПараметров.Вставить("ВидДокумента", НСтр("ru = 'сверки взаиморасчетов'"));
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов",
		ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов); 
	СтруктураПараметров.Вставить("ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов",
		ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов);
	СтруктураПараметров.Вставить("ТолькоПросмотр", ТолькоПросмотр);

	ШапкаТабличнаяЧастьЗавершение = Новый ОписаниеОповещения("ШапкаТабличнаяЧастьЗавершение", ЭтотОбъект);
			
	ОткрытьФорму("ОбщаяФорма.ШапкаТабличнаяЧасть", СтруктураПараметров, , , , , ШапкаТабличнаяЧастьЗавершение);

КонецПроцедуры

&НаКлиенте
Процедура ШапкаТабличнаяЧастьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.БылиВнесеныИзменения Тогда
		
		ОбновитьФорму = Ложь;
		Если Результат.Свойство("ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов") Тогда
			ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов = 
				Результат.ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов;
			ОбновитьФорму = Истина;
		КонецЕсли;		
		
		Если Результат.Свойство("ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов") Тогда
			ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов = Результат.ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов;
			ОбновитьФорму = Истина;
		КонецЕсли;

		Если ОбновитьФорму Тогда
			УстановитьВидимостьЭлементовПоНастройкеПользователя(ЭтотОбъект);
		КонецЕсли;
								
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ДокументыУНФ.ОрганизацияПриИзменении(ЭтотОбъект, Объект);
	
	ПодписьИзНастроек = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеНастройки(
		"ПодписьГлавногоБухгалтера",Объект.Организация);
	
	Если ЗначениеЗаполнено(ПодписьИзНастроек) Тогда
		Объект.ПодписьОтветственного = ПодписьИзНастроек
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияРеквизитовПечати(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ПечатьДокументовУНФКлиент.ОбновитьЗначенияРеквизитовПечати(ЭтотОбъект, Результат.ИзмененныеРеквизиты);
		
		Если Результат.Свойство("Команда") Тогда
			
			Подключаемый_ВыполнитьКоманду(Результат.Команда);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура заполняет описание расчетного документа в строке табличного поля
//
Процедура ЗаполнитьОписаниеРасчетногоДокумента(ДанныеТекущейСтроки, ЭтоДанныеОрганизации)
	
	Если ДанныеТекущейСтроки <> Неопределено Тогда
		
		СтруктураДанныхСтроки = Новый Структура;
		СтруктураДанныхСтроки.Вставить("Договор", ДанныеТекущейСтроки.Договор);
		СтруктураДанныхСтроки.Вставить("РасчетныйДокумент", ДанныеТекущейСтроки.РасчетныйДокумент);
		Если ЭтоДанныеОрганизации Тогда
			
			СтруктураДанныхСтроки.Вставить("НомерДокумента", ДанныеТекущейСтроки.НомерДокумента);
			СтруктураДанныхСтроки.Вставить("ДатаДокумента", ДанныеТекущейСтроки.ДатаДокумента);
			
			// При ручном добавлении предполагаем, что вх. номер и дату пользователь указал самостоятельно
			ОписаниеРасчетногоДокументаОрганизации(СтруктураДанныхСтроки);
			ДанныеТекущейСтроки.ВалютаДоговора = ?(СтруктураДанныхСтроки.Свойство("ВалютаДокумента"), СтруктураДанныхСтроки.ВалютаДокумента, Объект.ВалютаДокумента);
			
		Иначе
			
			СтруктураДанныхСтроки.Вставить("ВхНомерДокумента", ДанныеТекущейСтроки.ВхНомерДокумента);
			СтруктураДанныхСтроки.Вставить("ВхДатаДокумента", ДанныеТекущейСтроки.ВхДатаДокумента);
			
			// При ручном добавлении предполагаем, что вх. номер и дату пользователь указал самостоятельно
			ОписаниеРасчетногоДокументаКонтрагента(СтруктураДанныхСтроки);
			ДанныеТекущейСтроки.ВалютаДокумента = ?(СтруктураДанныхСтроки.Свойство("ВалютаДокумента"), СтруктураДанныхСтроки.ВалютаДокумента, Объект.ВалютаДокумента);
			
		КонецЕсли;
		
		ДанныеТекущейСтроки.ОписаниеДокумента = СтруктураДанныхСтроки.ОписаниеДокумента;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьОписаниеРасчетногоДокумента()

&НаКлиенте
// Процедура устанавливает картинку для страницы данные контрагента
//
Процедура УстановитьКартинкуСтраницыДанныеКонтрагента()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтраницаДанныеКонтрагента", "Картинка", 
		?(Объект.ДанныеКонтрагента.Количество() > 0, БиблиотекаКартинок.Информация, Новый Картинка));
	
КонецПроцедуры

&НаКлиенте
// Процедура очищает табличные части документа
//
Процедура ОчиститьДанныеДокумента()
	
	Объект.СальдоНачалоПериода = 0;
	Объект.ДанныеОрганизации.Очистить();
	Объект.ДанныеКонтрагента.Очистить();
	
КонецПроцедуры //ОчиститьДанныеДокумента()

&НаКлиенте
// Процедура заполняет заголовок поля ОписаниеВыбораДоговоров
//
Процедура ЗаполнитьЗаголовокПоВыбраннымДоговорам()
	
	МассивОтмеченных = Объект.ДоговорыКонтрагентов.НайтиСтроки(Новый Структура("Отметка", Истина));
	Если Объект.ДоговорыКонтрагентов.Количество() = 0 Тогда
		
		ТекстНадписи = НСтр("ru = 'Договоры не выбраны'");
		
	ИначеЕсли МассивОтмеченных.Количество() = 1 Тогда
		
		ТекстНадписи = Строка(МассивОтмеченных[0].Договор);
		
	Иначе
		
		ТекстНадписи = Строка(МассивОтмеченных[0].Договор) + ", " + Строка(МассивОтмеченных[1].Договор) + ?(МассивОтмеченных.Количество() > 2, "...", "");
		
	КонецЕсли;
	
	ОписаниеВыбораДоговоров = ТекстНадписи;
	
КонецПроцедуры // ЗаполнитьЗаголовокДоговоров()

&НаКлиенте
// Процедура заполнения табличной части "Данные организации" по данным учета
//
Процедура ЗаполнитьПоОстаткам()
	
	РассчитатьНачальноеСальдо();
	ЗаполнитьПоОстаткамСервер();
	ПересчитатьОстатки(ЭтотОбъект);
	УстановитьКартинкуСтраницыДанныеКонтрагента();
	
КонецПроцедуры // ЗаполнитьПоОстаткам()

&НаКлиенте
// Процедура заполнения табличной части "Данные контрагента" по данным учета
//
Процедура ЗаполнитьСведенияКонтрагентаПоДаннымОрганизации()
	
	ЗаполнитьПоДаннымОрганизацииНаСервере();
	ПересчитатьОстатки(ЭтотОбъект);
	УстановитьКартинкуСтраницыДанныеКонтрагента();
	
КонецПроцедуры // ЗаполнитьСведенияКонтрагентаПоДаннымОрганизации()

&НаКлиенте
// Процедура подготавливает массив договоров, по которым рассчитывается начальное сальдо
//
Процедура РассчитатьНачальноеСальдо()
	
	МассивДоговоров = Новый Массив;
	Для каждого СтрокаДоговора Из Объект.ДоговорыКонтрагентов Цикл
		
		Если СтрокаДоговора.Отметка Тогда
			
			МассивДоговоров.Добавить(СтрокаДоговора.Договор);
			
		КонецЕсли;
		
	КонецЦикла;
	
	НачальноеСальдоПоДоговорам(Объект.Организация, Объект.НачалоПериода, МассивДоговоров, Объект.ВалютаДокумента, Объект.СальдоНачалоПериода);
	
КонецПроцедуры // НачальноеСальдо()

&НаСервере
// Вызывает процедуру заполнения пустых дат контрагента на сервере
//
Процедура ЗаполнитьДатыВСведенияхКонтрагентаИзРасчетныхДокументов()
	
	Для каждого СтрокаДанных Из Объект.ДанныеКонтрагента Цикл
		
		Если ЗначениеЗаполнено(СтрокаДанных.ВхДатаДокумента) 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаДанных.РасчетныйДокумент) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Если ТипЗнч(СтрокаДанных.РасчетныйДокумент) = Тип("ДокументСсылка.ЗаказПокупателя")
			И СтрокаДанных.РасчетныйДокумент.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			
			СтрокаДанных.ВхДатаДокумента = СтрокаДанных.РасчетныйДокумент.Финиш;
			
		Иначе
			
			СтрокаДанных.ВхДатаДокумента = СтрокаДанных.РасчетныйДокумент.Дата;
			
		КонецЕсли;
		
		СтрокаДанных.ОписаниеДокумента = 
			Документы.СверкаВзаиморасчетов.ОписаниеРасчетногоДокументаКонтрагента(СтрокаДанных.РасчетныйДокумент, "", СтрокаДанных.ВхНомерДокумента, СтрокаДанных.ВхДатаДокумента);
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьДатыВСведенияхКонтрагентаИзРасчетныхДокументов()

&НаСервере
// Процедура формирует структуру с данными документа
//
Функция ПолучитьДанныеДокумента(ДокументСсылка = Неопределено)
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("Дата",					Объект.Дата);
	ДанныеДокумента.Вставить("НачалоПериода",			Объект.НачалоПериода);
	ДанныеДокумента.Вставить("КонецПериода", 			Объект.КонецПериода);
	ДанныеДокумента.Вставить("Организация",				Константы.УчетПоКомпании.Компания(Объект.Организация));
	ДанныеДокумента.Вставить("Ссылка",					ДокументСсылка);
	ДанныеДокумента.Вставить("СортироватьПоДоговорам",	Объект.СортироватьПоДоговорам);
	ДанныеДокумента.Вставить("ВалютаДокумента",			Объект.ВалютаДокумента);
	ДанныеДокумента.Вставить("ОрганизациюВПредставление",Объект.ДобавлятьОрганизациюВПредставлениеДокумента);
	ДанныеДокумента.Вставить("УказатьСчетФактуру",		Объект.ДобавлятьСчетФактуруВПредставлениеДокумента);
	ДанныеДокумента.Вставить("ВхНомерВПоступлениеНаСчет",Объект.ВходящийНомерВПредставлениеПоступленияНаСчет);
	ДанныеДокумента.Вставить("ВхНомерВРасходСоСчета",	Объект.ВходящийНомерВПредставлениеРасходаСоСчета);
	ДанныеДокумента.Вставить("ПоВходящимДатам",			ЗаполнятьПоВходящимДатам);
	ДанныеДокумента.Вставить("Контрагент",				Объект.Контрагент);
	ДанныеДокумента.Вставить("ВестиРасчетыПоДоговорам",	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "ВестиРасчетыПоДоговорам"));
	
	Если ДанныеДокумента.ВестиРасчетыПоДоговорам = Неопределено Тогда
		ДанныеДокумента.ВестиРасчетыПоДоговорам = Ложь;
	КонецЕсли;
	
	МассивСтрок = Объект.ДоговорыКонтрагентов.НайтиСтроки(Новый Структура("Отметка", Истина));
	ДанныеДокумента.Вставить("ДоговорыКонтрагентов",	Объект.ДоговорыКонтрагентов.Выгрузить(МассивСтрок));
	
	Возврат ДанныеДокумента;
	
КонецФункции //ПолучитьДанныеДокумента()

&НаСервере
// Процедура заполнения табличной части "Данные организации"
//
Процедура ЗаполнитьПоОстаткамСервер()
	
	Документы.СверкаВзаиморасчетов.ЗаполнитьДанныеПоОрганизации(ПолучитьДанныеДокумента(), Объект.ДанныеОрганизации);
	
КонецПроцедуры // ЗаполнитьПоОстаткамСервер()

&НаСервере
// Процедура заполнения табличной части "Данные контрагента" по данным учета
//
Процедура ЗаполнитьПоДаннымОрганизацииНаСервере()
	
	Документы.СверкаВзаиморасчетов.ЗаполнитьСведенияКонтрагентаПоДаннымОрганизации(Объект.ДанныеОрганизации, Объект.ДанныеКонтрагента, Объект.ДобавлятьОрганизациюВПредставлениеДокумента, Объект.ДобавлятьСчетФактуруВПредставлениеДокумента, Объект.Организация);
	
КонецПроцедуры // ЗаполнитьПоОстаткамСервер()

// Заполняет описание расчетного документа и валюту взаиморасчетов в табличной части ДанныеОрганизации
//
// Параметры:
//    ДокументСсылка - ДокументСсылка - Ссылка на расчетный документ;
//    ОписаниеДокумента - Строка - Переменная, в которую будет передано описание расчетного документа;
//    ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Переменная, в которую будет передано значение валюты взаиморасчетов.
//
&НаСервере
Процедура ОписаниеРасчетногоДокументаОрганизации(СтруктураДанныхСтроки)
	
	ДанныеДокумента = ПолучитьДанныеДокумента(СтруктураДанныхСтроки.РасчетныйДокумент);
	ОписаниеДокумента = Документы.СверкаВзаиморасчетов.ОписаниеРасчетногоДокументаОрганизации(
		СтруктураДанныхСтроки.РасчетныйДокумент, ДанныеДокумента, СтруктураДанныхСтроки.НомерДокумента,
		СтруктураДанныхСтроки.ДатаДокумента);
	
	СтруктураДанныхСтроки.Вставить("ОписаниеДокумента", ОписаниеДокумента);
	
	Если ЗначениеЗаполнено(СтруктураДанныхСтроки.Договор) Тогда
		
		СтруктураДанныхСтроки.Вставить("ВалютаДокумента", СтруктураДанныхСтроки.Договор.ВалютаРасчетов);
		
	КонецЕсли;
	
КонецПроцедуры

// Заполняет описание расчетного документа и валюту взаиморасчетов в табличной части ДанныеКонтрагента
//
// Параметры:
//    ДокументСсылка - ДокументСсылка - Ссылка на расчетный документ;
//    ОписаниеДокумента - Строка - Переменная, в которую будет передано описание расчетного документа;
//    ВалютаВзаиморасчетов - СправочникСсылка.Валюты - Переменная, в которую будет передано значение валюты взаиморасчетов.
//
&НаСервереБезКонтекста
Процедура ОписаниеРасчетногоДокументаКонтрагента(СтруктураДанныхСтроки)
	
	ОписаниеДокумента = Документы.СверкаВзаиморасчетов.ОписаниеРасчетногоДокументаКонтрагента(
		СтруктураДанныхСтроки.РасчетныйДокумент, "", СтруктураДанныхСтроки.ВхНомерДокумента,
		СтруктураДанныхСтроки.ВхДатаДокумента);
	
	СтруктураДанныхСтроки.Вставить("ОписаниеДокумента", ОписаниеДокумента);
	
	Если ЗначениеЗаполнено(СтруктураДанныхСтроки.Договор) Тогда
		
		СтруктураДанныхСтроки.Вставить("ВалютаДокумента", СтруктураДанныхСтроки.Договор.ВалютаРасчетов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура вычисляет начальное сальдо по указанным договорам контрагента
//
// Организация (Объект.Организация) - организация, по которой вычисляется начальное сальдо взаиморасчетов
// ДоговорыКонтрагентов (Объект.ДоговорыКонтрагентов) - табличная часть документа
//
Процедура НачальноеСальдоПоДоговорам(Организация, Знач НачалоПериода, ДоговорыКонтрагентов, ВалютаДокумента, СальдоНачалоПериода)
	
	Если НЕ ЗначениеЗаполнено(НачалоПериода) Тогда
		
		НачалоПериода = Дата(1980, 01, 01);
		
	КонецЕсли;
	
	СальдоНачалоПериода = 0;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Константы.УчетПоКомпании.Компания(Организация));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ДоговорыКонтрагентов", ДоговорыКонтрагентов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ПОМЕСТИТЬ ДоговорыКонтрагентов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка В(&ДоговорыКонтрагентов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаВалОстаток > 0
	|				И РасчетыСПокупателямиОстатки.СуммаВалОстаток < 0
	|			ТОГДА -1 * РасчетыСПокупателямиОстатки.СуммаВалОстаток + РасчетыСПоставщикамиОстатки.СуммаВалОстаток
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаВалОстаток > 0
	|			ТОГДА РасчетыСПоставщикамиОстатки.СуммаВалОстаток
	|		КОГДА РасчетыСПокупателямиОстатки.СуммаВалОстаток < 0
	|			ТОГДА -РасчетыСПокупателямиОстатки.СуммаВалОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаВалОстаток < 0
	|				И РасчетыСПокупателямиОстатки.СуммаВалОстаток > 0
	|			ТОГДА -1 * РасчетыСПоставщикамиОстатки.СуммаВалОстаток + РасчетыСПокупателямиОстатки.СуммаВалОстаток
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаВалОстаток < 0
	|			ТОГДА -РасчетыСПоставщикамиОстатки.СуммаВалОстаток
	|		КОГДА РасчетыСПокупателямиОстатки.СуммаВалОстаток > 0
	|			ТОГДА РасчетыСПокупателямиОстатки.СуммаВалОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ - ЕСТЬNULL(РасчетыСПрочимиКонтрагентамиОстатки.СуммаВалОстаток, 0) КАК СальдоВал,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток > 0
	|				И РасчетыСПокупателямиОстатки.СуммаОстаток < 0
	|			ТОГДА -1 * РасчетыСПокупателямиОстатки.СуммаОстаток + РасчетыСПоставщикамиОстатки.СуммаОстаток
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток > 0
	|			ТОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток
	|		КОГДА РасчетыСПокупателямиОстатки.СуммаОстаток < 0
	|			ТОГДА -РасчетыСПокупателямиОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток < 0
	|				И РасчетыСПокупателямиОстатки.СуммаОстаток > 0
	|			ТОГДА -1 * РасчетыСПоставщикамиОстатки.СуммаОстаток + РасчетыСПокупателямиОстатки.СуммаОстаток
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаОстаток < 0
	|			ТОГДА -РасчетыСПоставщикамиОстатки.СуммаОстаток
	|		КОГДА РасчетыСПокупателямиОстатки.СуммаОстаток > 0
	|			ТОГДА РасчетыСПокупателямиОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ - ЕСТЬNULL(РасчетыСПрочимиКонтрагентамиОстатки.СуммаОстаток, 0) КАК СальдоУпр,
	|	ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаРегОстаток > 0
	|				И РасчетыСПокупателямиОстатки.СуммаРегОстаток < 0
	|			ТОГДА -1 * РасчетыСПокупателямиОстатки.СуммаРегОстаток + РасчетыСПоставщикамиОстатки.СуммаРегОстаток
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаРегОстаток > 0
	|			ТОГДА РасчетыСПоставщикамиОстатки.СуммаРегОстаток
	|		КОГДА РасчетыСПокупателямиОстатки.СуммаРегОстаток < 0
	|			ТОГДА -РасчетыСПокупателямиОстатки.СуммаРегОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ - ВЫБОР
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаРегОстаток < 0
	|				И РасчетыСПокупателямиОстатки.СуммаРегОстаток > 0
	|			ТОГДА -1 * РасчетыСПоставщикамиОстатки.СуммаРегОстаток + РасчетыСПокупателямиОстатки.СуммаРегОстаток
	|		КОГДА РасчетыСПоставщикамиОстатки.СуммаРегОстаток < 0
	|			ТОГДА -РасчетыСПоставщикамиОстатки.СуммаРегОстаток
	|		КОГДА РасчетыСПокупателямиОстатки.СуммаРегОстаток > 0
	|			ТОГДА РасчетыСПокупателямиОстатки.СуммаРегОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ - ЕСТЬNULL(РасчетыСПрочимиКонтрагентамиОстатки.СуммаОстаток, 0) КАК СальдоРег,
	|	ДоговорыКонтрагентов.Договор.ВалютаРасчетов КАК ВалютыРасчетов
	|ИЗ
	|	ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПокупателями.Остатки(&НачалоПериода, Организация = &Организация) КАК РасчетыСПокупателямиОстатки
	|		ПО ДоговорыКонтрагентов.Договор = РасчетыСПокупателямиОстатки.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками.Остатки(&НачалоПериода, Организация = &Организация) КАК РасчетыСПоставщикамиОстатки
	|		ПО ДоговорыКонтрагентов.Договор = РасчетыСПоставщикамиОстатки.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(&НачалоПериода, Организация = &Организация) КАК РасчетыСПрочимиКонтрагентамиОстатки
	|		ПО ДоговорыКонтрагентов.Договор = РасчетыСПрочимиКонтрагентамиОстатки.Договор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УчетВалютныхОпераций = ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций");
	ВалютаУчета = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета();
	НациональнаяВалюта = УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
	
	Пока Выборка.Следующий() Цикл 
		
		СальдоПоДоговору = 0;
		
		Если УчетВалютныхОпераций Тогда
			
			Если ВалютаДокумента = Выборка.ВалютыРасчетов Тогда
				СальдоПоДоговору = Выборка.СальдоВал;
			ИначеЕсли ВалютаДокумента = ВалютаУчета Тогда
				СальдоПоДоговору = Выборка.СальдоУпр;
			ИначеЕсли ВалютаДокумента = НациональнаяВалюта Тогда
				СальдоПоДоговору = Выборка.СальдоРег;
			Иначе
				
				КурсВалютыРасчетов = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Выборка.ВалютыРасчетов, НачалоПериода);
				КурсВалютыДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаДокумента, НачалоПериода);
				
				Если Выборка.СальдоВал <> 0 Тогда
					
					ПараметрыТекущегоКурса = Новый Структура;
					ПараметрыТекущегоКурса.Вставить("Валюта",	Выборка.ВалютыРасчетов);
					ПараметрыТекущегоКурса.Вставить("Курс",		КурсВалютыРасчетов.Курс);
					ПараметрыТекущегоКурса.Вставить("Кратность",КурсВалютыРасчетов.Кратность);
					
					ПараметрыНовогоКурса = Новый Структура;
					ПараметрыНовогоКурса.Вставить("Валюта",		ВалютаДокумента);
					ПараметрыНовогоКурса.Вставить("Курс",		КурсВалютыДокумента.Курс);
					ПараметрыНовогоКурса.Вставить("Кратность",	КурсВалютыДокумента.Кратность);
					
					СальдоПоДоговору = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(Выборка.СальдоВал, ПараметрыТекущегоКурса, ПараметрыНовогоКурса);
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			СальдоПоДоговору = Выборка.СальдоВал;
			
		КонецЕсли;
		
		СальдоНачалоПериода = СальдоНачалоПериода + СальдоПоДоговору;
		
	КонецЦикла;
	
КонецПроцедуры // НачальноеСальдоПоДоговорам()

&НаСервере
// Настраивает доступность элементов формы в зависимости от статуса документа
//
Процедура УстановитьДоступностьЭлементов()
	
	// Реквизиты доступны только для статуса Создана
	СтатусСоздана = (Объект.Статус = Перечисления.СтатусыСверокВзаиморасчетов.Создана);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Организация", "Доступность", СтатусСоздана);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПериодСверки", "Доступность", СтатусСоздана);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ВалютаДокумента", "Доступность", СтатусСоздана);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Контрагент", "Доступность", СтатусСоздана);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Группа1", "Доступность", СтатусСоздана);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ЗаполнитьПоДаннымУчета", "Доступность", СтатусСоздана);
	
	// Реквизиты доступны для статусов Создана и НаСверке
	СтатусСверена = (Объект.Статус = Перечисления.СтатусыСверокВзаиморасчетов.Сверена);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДанныеОрганизации", "Доступность", НЕ СтатусСверена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСальдоВалюта", "Доступность", НЕ СтатусСверена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаШапкаСтраницыДанныеКонтрагента", "Доступность", НЕ СтатусСверена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаДанныеКонтагента", "Доступность", НЕ СтатусСверена);
	
	// Табличные части не входят в общее правило.
	// Для копирования представлений оставляем всегда доступными, но запрещаем редактирования (управляем свойством ТолькоПросмотр)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеОрганизации",	"ТолькоПросмотр", НЕ СтатусСоздана);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеКонтрагента", "ТолькоПросмотр", СтатусСверена);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Документы", "ТолькоПросмотр", СтатусСверена);
	
КонецПроцедуры // УстановитьДоступностьЭлементов()

&НаСервере
// Процедура получения данных контрагента
//
Процедура ПолучитьДанныеКонтрагента(ДанныеКонтрагента)
	
	ДанныеКонтрагента = Новый Структура;
	ДанныеКонтрагента.Вставить("КонтактноеЛицо", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "КонтактноеЛицоПодписант"));
	
	// Если контрагент поменялся, повторим заполнение договоров
	ЗаполнитьДанные = Истина;
	Если Объект.ДоговорыКонтрагентов.Количество() > 0 Тогда
		
		Если Объект.ДоговорыКонтрагентов[0].Договор.Владелец = Объект.Контрагент И УчетПоКомпании Тогда
			
			ЗаполнитьДанные = Ложь;
			
		Иначе
			
			Объект.ДоговорыКонтрагентов.Очистить();
			Объект.ДанныеОрганизации.Очистить();
			Объект.ДанныеКонтрагента.Очистить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеКонтрагента.Вставить("ВестиРасчетыПоДоговорам", Объект.Контрагент.ВестиРасчетыПоДоговорам);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ОписаниеВыбораДоговоров", "Доступность", Объект.Контрагент.ВестиРасчетыПоДоговорам);
	
	Если ЗаполнитьДанные Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("БезОтбораПоОрганизации", УчетПоКомпании Или Не ДанныеКонтрагента.ВестиРасчетыПоДоговорам);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИСТИНА КАК Отметка,
		|	СправочникДоговорыКонтрагентов.Ссылка КАК Договор,
		|	СправочникДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК СправочникДоговорыКонтрагентов
		|ГДЕ
		|	СправочникДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ВЫБОР
		|			КОГДА &БезОтбораПоОрганизации
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ СправочникДоговорыКонтрагентов.Организация = &Организация
		|		КОНЕЦ";
		
		Объект.ДоговорыКонтрагентов.Загрузить(Запрос.Выполнить().Выгрузить());
		ОписаниеВыбораДоговоров = НСтр("ru = 'Выбраны все договоры контрагента'");
		
		Если ПолучитьФункциональнуюОпцию("ПередачаТоваровМеждуОрганизациями") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИСТИНА КАК Отметка,
			|	СправочникДоговорыКонтрагентов.Ссылка КАК Договор,
			|	СправочникДоговорыКонтрагентов.ВалютаРасчетов КАК ВалютаДоговора
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК СправочникДоговорыКонтрагентов
			|ГДЕ
			|	СправочникДоговорыКонтрагентов.ЭтоДоговорПередачиТоваровМеждуОрганизациями
			|	И (СправочникДоговорыКонтрагентов.Владелец, СправочникДоговорыКонтрагентов.Организация) В
			|			(ВЫБРАТЬ
			|				НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияВладелец КАК ОрганизацияВладелец,
			|				НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияПродавец КАК ОрганизацияПродавец
			|			ИЗ
			|				РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями КАК НастройкаПередачиТоваровМеждуОрганизациями
			|			ГДЕ
			|				НастройкаПередачиТоваровМеждуОрганизациями.КонтрагентПродавец = &Контрагент
			|				И НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияВладелец = &Организация
			|		
			|			ОБЪЕДИНИТЬ ВСЕ
			|		
			|			ВЫБРАТЬ
			|				НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияПродавец,
			|				НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияВладелец
			|			ИЗ
			|				РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями КАК НастройкаПередачиТоваровМеждуОрганизациями
			|			ГДЕ
			|				НастройкаПередачиТоваровМеждуОрганизациями.КонтрагентПродавец = &Контрагент
			|				И НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияВладелец = &Организация
			|		
			|			ОБЪЕДИНИТЬ ВСЕ
			|		
			|			ВЫБРАТЬ
			|				НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияВладелец,
			|				НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияПродавец
			|			ИЗ
			|				РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями КАК НастройкаПередачиТоваровМеждуОрганизациями
			|			ГДЕ
			|				НастройкаПередачиТоваровМеждуОрганизациями.КонтрагентВладельца = &Контрагент
			|				И НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияПродавец = &Организация
			|		
			|			ОБЪЕДИНИТЬ ВСЕ
			|		
			|			ВЫБРАТЬ
			|				НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияПродавец,
			|				НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияВладелец
			|			ИЗ
			|				РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями КАК НастройкаПередачиТоваровМеждуОрганизациями
			|			ГДЕ
			|				НастройкаПередачиТоваровМеждуОрганизациями.КонтрагентВладельца = &Контрагент
			|				И НастройкаПередачиТоваровМеждуОрганизациями.ОрганизацияПродавец = &Организация)";
			
			Запрос.УстановитьПараметр("Контрагент",  Объект.Контрагент);
			Запрос.УстановитьПараметр("Организация",  Объект.Организация);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				НоваяСтрокаДоговора = Объект.ДоговорыКонтрагентов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаДоговора, ВыборкаДетальныеЗаписи);
			КонецЦикла;
			
		КонецЕсли;
		
		ДоговорыКонтрагентов = Объект.ДоговорыКонтрагентов.Выгрузить(,"Договор");
		
		НачальноеСальдоПоДоговорам(Объект.Организация, Объект.НачалоПериода, ДоговорыКонтрагентов, Объект.ВалютаДокумента, Объект.СальдоНачалоПериода);
		
	КонецЕсли;
	
КонецПроцедуры // ПолучитьДанныеКонтрагента()

&НаСервереБезКонтекста
// Процедура полученных данных договора 
// Вызывается после выбора договора
//
Процедура ПолучитьДанныеДоговора(ДанныеДоговора, Договор)
	
	ДанныеДоговора.Вставить("ВалютаДоговора", Договор.ВалютаРасчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткамиНаКлиенте()
	
	ВызватьПроцедуруЗаполненияТабличнойЧасти = Истина;
	
	Если НЕ ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		
		ТекстСообщения	= НСтр("ru = 'Неверно заполнена дата окончания периода.'");
		ПолеСообщения	= "Объект.КонецПериода";
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , ПолеСообщения);
		
		ВызватьПроцедуруЗаполненияТабличнойЧасти = Ложь;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		
		ТекстСообщения	= НСтр("ru = 'Не заполнен контрагент.'");
		ПолеСообщения	= "Объект.Контрагент";
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , ПолеСообщения);
		
		ВызватьПроцедуруЗаполненияТабличнойЧасти = Ложь;
		
	КонецЕсли;
	
	Если ВызватьПроцедуруЗаполненияТабличнойЧасти Тогда
		
		Если Объект.ДанныеОрганизации.Количество() > 0 Тогда
			
			ТестВопроса	= НСтр("ru = 'Табличная часть будет очищена и заполнена повторно. Продолжить?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикПослеВопросаООчистке", ЭтотОбъект, "ДанныеОрганизации");
			ПоказатьВопрос(ОписаниеОповещения, ТестВопроса, РежимДиалогаВопрос.ДаНет, 0);
			
		Иначе
			
			ЗаполнитьПоОстаткам();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРеквизитыПечати()

	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзмененияРеквизитовПечати", ЭтотОбъект);
	ОткрытьФорму("Обработка.РеквизитыПечати.Форма.РеквизитыПечатиСверкаВзаиморасчетов", 
		Новый Структура("КонтекстПечати", Объект), ЭтотОбъект, , , , ОписаниеОповещения);
		
КонецПроцедуры 

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьОстатки(Форма)

	Объект = Форма.Объект;
	
	Форма.ОстатокНаНачало = - Объект.СальдоНачалоПериода;
	
	Форма.ОстатокНаКонец = Форма.ОстатокНаНачало
		+ Объект.ДанныеОрганизации.Итог("СуммаДолгКонтрагента")
		- Объект.ДанныеОрганизации.Итог("СуммаДолгОрганизации");
		
	Если Форма.ОстатокНаНачало > 0 Тогда
		Форма.ОстатокНаНачалоПояснение = НСтр("ru='(долг контрагента)'");
	ИначеЕсли Форма.ОстатокНаНачало < 0 Тогда 
		Форма.ОстатокНаНачалоПояснение = НСтр("ru='(долг организации)'");
	Иначе 
		Форма.ОстатокНаНачалоПояснение = "";
	КонецЕсли;
		
	Если Форма.ОстатокНаКонец > 0 Тогда
		Форма.ОстатокНаКонецПояснение = НСтр("ru='(долг контрагента)'");
	ИначеЕсли Форма.ОстатокНаКонец < 0 Тогда 
		Форма.ОстатокНаКонецПояснение = НСтр("ru='(долг организации)'");
	Иначе 
		Форма.ОстатокНаКонецПояснение = "";
	КонецЕсли;
	
	Форма.ОстатокНаНачалоКонтрагент = - Форма.ОстатокНаНачало;

	Форма.ОстатокНаКонецКонтрагент = Форма.ОстатокНаНачалоКонтрагент
		+ Объект.ДанныеКонтрагента.Итог("СуммаДолгКонтрагента")
		- Объект.ДанныеКонтрагента.Итог("СуммаДолгОрганизации");
		
	Если Форма.ОстатокНаНачалоКонтрагент < 0 Тогда
		Форма.ОстатокНаНачалоКонтрагентПояснение = НСтр("ru='(долг контрагента)'");
	ИначеЕсли Форма.ОстатокНаНачалоКонтрагент > 0 Тогда 
		Форма.ОстатокНаНачалоКонтрагентПояснение = НСтр("ru='(долг организации)'");
	Иначе 
		Форма.ОстатокНаНачалоКонтрагентПояснение = "";
	КонецЕсли;
		
	Если Форма.ОстатокНаКонецКонтрагент < 0 Тогда
		Форма.ОстатокНаКонецКонтрагентПояснение = НСтр("ru='(долг контрагента)'");
	ИначеЕсли Форма.ОстатокНаКонецКонтрагент > 0 Тогда 
		Форма.ОстатокНаКонецКонтрагентПояснение = НСтр("ru='(долг организации)'");
	Иначе 
		Форма.ОстатокНаКонецКонтрагентПояснение = "";
	КонецЕсли;
	
	Форма.Расхождение = Форма.ОстатокНаКонец + Форма.ОстатокНаКонецКонтрагент;
	Форма.РасхождениеКонтрагент = - Форма.Расхождение;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементовПоНастройкеПользователя(Форма)
	
	Элементы = Форма.Элементы;
	
	// Видимость колонок, настроенная пользователем
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеОрганизацииРасчетныйДокумент",
		"Видимость", Форма.ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеКонтрагентаРасчетныйДокумент",
		"Видимость", Форма.ПоказыватьКолонкуРасчетныйДокументВСверкеВзаиморасчетов);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеОрганизацииВалютаПоДокументу",
		"Видимость", Форма.ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ДанныеКонтрагентаВалютаПоДокументу",
		"Видимость", Форма.ПоказыватьКолонкуВалютаВСверкеВзаиморасчетов);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеДекорацияИнформацияНовоеФаксимилеЗакрыть(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ГруппаИнформацияНовоеФаксимиле", "Видимость", Ложь);
	
	ВыключитьИнформированиеНовоеФаксимиле();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыключитьИнформированиеНовоеФаксимиле()
	
	ПечатьДокументовУНФ.ВыключитьИнформированиеНовоеФаксимиле();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
// Процедура обрабатывает результат вопроса о очистке ТЧ 
//
Процедура ОбработчикПослеВопросаООчистке(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Да Тогда
		
		Если ДополнительныеПараметры = "ДанныеОрганизации" Тогда
			
			ЗаполнитьПоОстаткам();
			
		ИначеЕсли ДополнительныеПараметры = "ДанныеКонтрагента" Тогда
			
			ЗаполнитьСведенияКонтрагентаПоДаннымОрганизации()
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработчикПослеВопросаООчистке()

&НаКлиенте
// Процедура обрабатывает результат вопроса о очистке ТЧ после изменения реквизита группировать по договорам
//
Процедура ОбработчикПослеВопросаООчисткеГруппироватьПоДоговорам(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Да Тогда
		Объект.ДанныеОрганизации.Очистить();
		Объект.ДанныеКонтрагента.Очистить();
	Иначе
		Объект.СортироватьПоДоговорам = Не Объект.СортироватьПоДоговорам;
	КонецЕсли;
	
КонецПроцедуры // ОбработчикПослеВопросаООчисткеГруппироватьПоДоговорам()

&НаКлиенте
// Процедура обрабатывает результат выбора договоров контрагента
//
Процедура ПослеВыбораДоговоровКонтрагента(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		ЕстьИзменения = Ложь;
		ЕстьИзменения = РезультатЗакрытия.ДоговорыКонтрагентов.Количество() <> Объект.ДоговорыКонтрагентов.Количество()
			ИЛИ РезультатЗакрытия.СортироватьПоДоговорам <> Объект.СортироватьПоДоговорам;
		Если НЕ ЕстьИзменения Тогда
			
			РазмерСписка = РезультатЗакрытия.ДоговорыКонтрагентов.Количество();
			Пока РазмерСписка > 0 Цикл
				
				ИндексЭлемента = РазмерСписка - 1;
				Если РезультатЗакрытия.ДоговорыКонтрагентов[ИндексЭлемента].Договор <> Объект.ДоговорыКонтрагентов[ИндексЭлемента].Договор 
					ИЛИ РезультатЗакрытия.ДоговорыКонтрагентов[ИндексЭлемента].Отметка <> Объект.ДоговорыКонтрагентов[ИндексЭлемента].Отметка Тогда
					
					ЕстьИзменения = Истина;
					Прервать;
					
				КонецЕсли;
				
				РазмерСписка = РазмерСписка - 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЕстьИзменения Тогда
			
			Объект.ДоговорыКонтрагентов.Очистить();
			Объект.ДанныеОрганизации.Очистить();
			Объект.ДанныеКонтрагента.Очистить();
			
			Для каждого ЭлементКоллекции Из РезультатЗакрытия.ДоговорыКонтрагентов Цикл
				
				НоваяСтрока = Объект.ДоговорыКонтрагентов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции);
				
			КонецЦикла;
			
			Объект.СортироватьПоДоговорам = РезультатЗакрытия.СортироватьПоДоговорам;
			
			ЗаполнитьЗаголовокПоВыбраннымДоговорам();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПослеВыбораДоговоровКонтрагента()

&НаКлиенте
// Процедура обрабатывает результат выбора периода заполнения текущего документа
//
Процедура ПослеВыбораПериодаЗаполнения(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		ОчиститьДанныеДокумента();
		Если Объект.НачалоПериода <> РезультатЗакрытия.ДатаНачала Тогда
			
			Объект.НачалоПериода = РезультатЗакрытия.ДатаНачала;
			РассчитатьНачальноеСальдо();
			
		КонецЕсли;
		
		Объект.КонецПериода = РезультатЗакрытия.ДатаОкончания;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек

// ЭДО
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуЭДО(Команда)
	
	ЭлектронноеВзаимодействиеКлиент.ВыполнитьПодключаемуюКомандуЭДО(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияЭДО()
	
	ОбменСКонтрагентамиКлиент.ОбработчикОжиданияЭДО(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеЭДОНажатие(Элемент, СтандартнаяОбработка)
	ОбменСКонтрагентамиКлиент.СостояниеЭДОНажатие_ФормаДокумента(ЭтотОбъект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СпособСоставленияПриИзменении(Элемент)
	
	ПриИзмененииСпособаСоставленияЭД();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСпособаСоставленияЭД()
	
	Элементы.ДанныеОрганизацииДатаОперации.Видимость = Объект.ЭтоЭлектронныйДокумент;
	Элементы.ДанныеОрганизацииНаименованиеОперации.Видимость = Объект.ЭтоЭлектронныйДокумент;
	Элементы.ДанныеКонтрагентаДатаОперации.Видимость = Объект.ЭтоЭлектронныйДокумент;
	Элементы.ДанныеКонтрагентаНаименованиеОперации.Видимость = Объект.ЭтоЭлектронныйДокумент;
	
КонецПроцедуры
// Конец ЭДО

// СтандартныеПодсистемы.ПодключаемыеКоманды
//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Обсуждения
	ОбсужденияУНФКлиент.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект, Объект.Ссылка);
	// Конец Обсуждения
	
	// ЭДО
	ПараметрыОповещения = ОбменСКонтрагентамиКлиент.ПараметрыОповещенияЭДО_ФормаДокумента();
	ПараметрыОповещения.Форма = ЭтотОбъект;
	ПараметрыОповещения.ДокументСсылка = Объект.Ссылка;
	ПараметрыОповещения.КонтроллерСостояниеЭДО = Элементы.СостояниеЭДО;
	ПараметрыОповещения.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	
	ОбменСКонтрагентамиКлиент.ОбработкаОповещения_ФормаДокумента(ИмяСобытия, Параметр, Источник, ПараметрыОповещения);
	// Конец ЭДО
	
КонецПроцедуры // ОбработкаОповещения()

#КонецОбласти
